package chatBot;

import java.util.ArrayList;


public class Jokes {
    public static ArrayList<String> jokesBase(){
        ArrayList<String> jokes = new ArrayList<String>();
        jokes.add("1Значит, заходят в бар: группоид, полугруппа с коммутативной операцией, моноид и группа. а бармен им говорит: что будете пить, г-жа абелева группа?");
        jokes.add("2Физику, математику и инженеру дали задание найти объём красного мячика. Физик погрузил мяч в стакан с водой и измерилл объём вытесненной жидкости. Математик измерил диаметр мяча и рассчитал тройной интеграл. Инженер достал из стола свою \"Таблицу объёмов красных резиновых мячиков\" и нашёл нужное значение.\n");
        jokes.add("3Математик видит у филармонии афишу о выступлении камерного оркестра и из любопытства решает заглянуть. Но через несколько минут выбегает разочарованный:- Тривиальный случай! k = 3.\n");
        jokes.add("4Заходит бесконечное множество математиков в бар, первый говорит мне одну кружку пива, второй мне -1 кружку пива, третий мне 1 кружку пива, четвертый мне -1 кружку пива.... Бармен подумал, подумал и говорит \"так, ребят, расходимся, вашему желанию нет предела\".\n");
        jokes.add("5Комплексный обед состоит из действительной и мнимой частей.");
        return jokes;
    }
}